app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", ""], ["body", ""], ["post_id", 1], ["created_at", "2017-11-14 20:02:51.993319"], ["updated_at", "2017-11-14 20:02:51.993319"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]

    @comment.save