app/controllers/line_items_controller.rb

  def create
    beer = Beer.find(params[:beer_id])
    @line_item = @cart.add_beer(beer)


    respond_to do |format|
      if @line_item.save
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-11-13 22:58:52.191061"], ["updated_at", "2017-11-13 22:58:52.191061"]]
INSERT INTO "line_items" ("beer_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 2], ["cart_id", 1], ["created_at", "2017-11-13 22:58:52.243552"], ["updated_at", "2017-11-13 22:58:52.243552"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2017-11-14 16:11:04.201361"], ["id", 3]]