app/controllers/store_controller.rb

SELECT "beers".* FROM "beers" ORDER BY "beers"."name" ASC
---
  def index
    @beers = Beer.order(:name)